miyalab/miyalab.stm32f446re/TIM/MiYALAB_STM32F446RE_TIM.h
	// CH2 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_2){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_5;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_2) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_2);
	}

	// CH3 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_3){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_0;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_3) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_3);
	}

	// CH4 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_4){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_1;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_4) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_4);
	}

	return Ret;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM4 PWM Mode クラス コンストラクタ
// TIM4_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM4_PwmMode::TIM4_PwmMode()
{
	__HAL_RCC_TIM4_CLK_ENABLE();
	hTim.Instance = TIM4;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM4 PWM Mode クラス　デストラクタ
// TIM4_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM4_PwmMode::~TIM4_PwmMode()
{
	HAL_TIM_PWM_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_PWM_DeInit(&hTim);
	__HAL_RCC_TIM4_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM4 PWM Mode クラス　Enable関数
// PWMを出力するチャンネルを設定します。
// UseChannel : MiYALAB::STM32F446RE::TIM::CHANNEL_1(チャンネル1(PB6)の使用許可)
//				MiYALAB::STM32F446RE::TIM::CHANNEL_2(チャンネル2(PB7)の使用許可)
//				MiYALAB::STM32F446RE::TIM::CHANNEL_3(チャンネル3(PB8)の使用許可)
//				MiYALAB::STM32F446RE::TIM::CHANNEL_4(チャンネル4(PB9)の使用許可)
// return : 0(正常)
//			otherwise(エラー)
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM4_PwmMode::Enable(uint8_t UseChannel)
{
	// エラー判定用
	uint8_t Ret = HAL_OK;

	// ハードウェア設定用データ群
	TIM_OC_InitTypeDef ConfigOC = {0};
	GPIO_InitTypeDef GpioInitStruct = {0};

	// GPIO設定
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF2_TIM4;

	// チャンネル設定
	ConfigOC.OCMode = TIM_OCMODE_PWM1;
	ConfigOC.Pulse = 0;
	ConfigOC.OCPolarity = TIM_OCNPOLARITY_HIGH;
	ConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

	// CH1 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_1){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_6;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_1) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_1);
	}

	// CH2 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_2){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_7;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_2) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_2);
	}

	// CH3 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_3){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_8;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_3) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_3);
	}

	// CH4 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_4){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_9;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_4) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_4);
	}

	return Ret;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM5 PWM Mode クラス コンストラクタ
// TIM5_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM5_PwmMode::TIM5_PwmMode()
{
	__HAL_RCC_TIM5_CLK_ENABLE();
	hTim.Instance = TIM5;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM5 PWM Mode クラス　デストラクタ
// TIM5_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM5_PwmMode::~TIM5_PwmMode()
{
	HAL_TIM_PWM_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_PWM_DeInit(&hTim);
	__HAL_RCC_TIM5_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM5 PWM Mode クラス　Enable関数
// PWMを出力するチャンネルを設定します。
// UseChannel : MiYALAB::STM32F446RE::TIM::CHANNEL_1(チャンネル1(PA1)の使用許可)
//				MiYALAB::STM32F446RE::TIM::CHANNEL_2(チャンネル2(PA2)の使用許可)
//				MiYALAB::STM32F446RE::TIM::CHANNEL_3(チャンネル3(PA3)の使用許可)
//				MiYALAB::STM32F446RE::TIM::CHANNEL_4(チャンネル4(PA4)の使用許可)
// return : 0(正常)
//			otherwise(エラー)
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM5_PwmMode::Enable(uint8_t UseChannel)
{
	// エラー判定用
	uint8_t Ret = HAL_OK;

	// ハードウェア設定用データ群
	TIM_OC_InitTypeDef ConfigOC = {0};
	GPIO_InitTypeDef GpioInitStruct = {0};

	// GPIO設定
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF2_TIM5;

	// チャンネル設定
	ConfigOC.OCMode = TIM_OCMODE_PWM1;
	ConfigOC.Pulse = 0;
	ConfigOC.OCPolarity = TIM_OCNPOLARITY_HIGH;
	ConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

	// CH1 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_1){
		__HAL_RCC_GPIOA_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_0;
		HAL_GPIO_Init(GPIOA, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_1) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_1);
	}

