miyalab/miyalab.stm32f446re/TIM/MiYALAB_STM32F446RE_TIM.h
	// CH2 使用
	if(UseChannel & MiYALAB::STM32F446RE::TIM::CHANNEL_2){
		__HAL_RCC_GPIOB_CLK_ENABLE();
		GpioInitStruct.Pin = GPIO_PIN_15;
		HAL_GPIO_Init(GPIOB, &GpioInitStruct);
		if(HAL_TIM_PWM_ConfigChannel(&hTim, &ConfigOC, TIM_CHANNEL_2) != HAL_OK){
			Ret = HAL_ERROR;
		}
		HAL_TIM_PWM_Start(&hTim, TIM_CHANNEL_2);
	}

	return Ret;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM Encoder Mode スーパークラス　Clear関数
// パルス係数初期化
//--------------------------------------------------------------------------------------------
inline void MiYALAB::STM32F446RE::TIM_EncoderMode::Clear()
{
	hTim.Instance->CNT = MiYALAB::STM32F446RE::TIM::ENCODER_CENTER;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM Encoder Mode スーパークラス　Encode関数
// return : パルス数
//--------------------------------------------------------------------------------------------
inline int16_t MiYALAB::STM32F446RE::TIM_EncoderMode::Read()
{
	return(hTim.Instance->CNT - MiYALAB::STM32F446RE::TIM::ENCODER_CENTER);
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM1 Encoder Mode クラス　コンストラクタ
// TIM1_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM1_EncoderMode::TIM1_EncoderMode()
{
	__HAL_RCC_TIM1_CLK_ENABLE();
	hTim.Instance = TIM1;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM1 Encoder Mode クラス　デストラクタ
// TIM1_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM1_EncoderMode::~TIM1_EncoderMode()
{
	HAL_TIM_Encoder_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_DeInit(&hTim);
	__HAL_RCC_TIM1_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM1 Encoder Mode クラス　Enable関数
// TIM1 CH1(PA8), CH2(PA9) のパルス入力許可
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM1_EncoderMode::Enable()
{
	// ハードウェア設定用データ群
	GPIO_InitTypeDef GpioInitStruct = {0};

	// クロック許可
	__HAL_RCC_GPIOA_CLK_ENABLE();

	// GPIO設定
	GpioInitStruct.Pin = GPIO_PIN_8 | GPIO_PIN_9;
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF1_TIM1;
	HAL_GPIO_Init(GPIOA, &GpioInitStruct);

	Clear();

	// パルス入力許可
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_1) != HAL_OK){
		return HAL_ERROR;
	}
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_2) != HAL_OK){
		return HAL_ERROR;
	}

	return HAL_OK;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM2 Encoder Mode クラス　コンストラクタ
// TIM2_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM2_EncoderMode::TIM2_EncoderMode()
{
	__HAL_RCC_TIM2_CLK_ENABLE();
	hTim.Instance = TIM2;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM2 Encoder Mode クラス　デストラクタ
// TIM2_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM2_EncoderMode::~TIM2_EncoderMode()
{
	HAL_TIM_Encoder_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_DeInit(&hTim);
	__HAL_RCC_TIM2_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM2 Encoder Mode クラス　Enable関数
// TIM2 CH1(PA5), CH2(PB3) のパルス入力許可
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM2_EncoderMode::Enable()
{
	// ハードウェア設定用データ群
	GPIO_InitTypeDef GpioInitStruct = {0};

	// クロック許可
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();

	// GPIO設定
	GpioInitStruct.Pin = GPIO_PIN_5;
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF1_TIM2;
	HAL_GPIO_Init(GPIOA, &GpioInitStruct);
	GpioInitStruct.Pin = GPIO_PIN_3;
	HAL_GPIO_Init(GPIOB, &GpioInitStruct);

	// パルス値初期化
	Clear();

	// パルス入力許可
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_1) != HAL_OK){
		return HAL_ERROR;
	}
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_2) != HAL_OK){
		return HAL_ERROR;
	}

	return HAL_OK;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM3 Encoder Mode クラス　コンストラクタ
// TIM3_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM3_EncoderMode::TIM3_EncoderMode()
{
	__HAL_RCC_TIM3_CLK_ENABLE();
	hTim.Instance = TIM3;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM3 Encoder Mode クラス　デストラクタ
// TIM3_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM3_EncoderMode::~TIM3_EncoderMode()
{
	HAL_TIM_Encoder_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_DeInit(&hTim);
	__HAL_RCC_TIM3_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM3 Encoder Mode クラス　Enable関数
// TIM3 CH1(PB4), CH2(PB5) のパルス入力許可
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM3_EncoderMode::Enable()
{
	// ハードウェア設定用データ群
	GPIO_InitTypeDef GpioInitStruct = {0};

	// クロック許可
	__HAL_RCC_GPIOB_CLK_ENABLE();

	// GPIO設定
	GpioInitStruct.Pin = GPIO_PIN_4 | GPIO_PIN_5;
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF2_TIM3;
	HAL_GPIO_Init(GPIOB, &GpioInitStruct);

	// パルス値初期化
	Clear();

	// パルス入力許可
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_1) != HAL_OK){
		return HAL_ERROR;
	}
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_2) != HAL_OK){
		return HAL_ERROR;
	}

	return HAL_OK;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM4 Encoder Mode クラス　コンストラクタ
// TIM4_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM4_EncoderMode::TIM4_EncoderMode()
{
	__HAL_RCC_TIM4_CLK_ENABLE();
	hTim.Instance = TIM4;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM4 Encoder Mode クラス　デストラクタ
// TIM4_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM4_EncoderMode::~TIM4_EncoderMode()
{
	HAL_TIM_Encoder_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_DeInit(&hTim);
	__HAL_RCC_TIM4_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM4 Encoder Mode クラス　Enable関数
// TIM4 CH1(PB6), CH2(PB7) のパルス入力許可
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM4_EncoderMode::Enable()
{
	// ハードウェア設定用データ群
	GPIO_InitTypeDef GpioInitStruct = {0};

	// クロック許可
	__HAL_RCC_GPIOB_CLK_ENABLE();

	// GPIO設定
	GpioInitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF2_TIM4;
	HAL_GPIO_Init(GPIOB, &GpioInitStruct);

	// パルス値初期化
	Clear();

	// パルス入力許可
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_1) != HAL_OK){
		return HAL_ERROR;
	}
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_2) != HAL_OK){
		return HAL_ERROR;
	}

	return HAL_OK;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM5 Encoder Mode クラス　コンストラクタ
// TIM5_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM5_EncoderMode::TIM5_EncoderMode()
{
	__HAL_RCC_TIM5_CLK_ENABLE();
	hTim.Instance = TIM5;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM5 Encoder Mode クラス　デストラクタ
// TIM5_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM5_EncoderMode::~TIM5_EncoderMode()
{
	HAL_TIM_Encoder_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_DeInit(&hTim);
	__HAL_RCC_TIM5_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM5 Encoder Mode クラス　Enable関数
// TIM5 CH1(PA0), CH2(PA1) のパルス入力許可
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM5_EncoderMode::Enable()
{
	// ハードウェア設定用データ群
	GPIO_InitTypeDef GpioInitStruct = {0};

	// クロック許可
	__HAL_RCC_GPIOA_CLK_ENABLE();

	// GPIO設定
	GpioInitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1;
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF2_TIM5;
	HAL_GPIO_Init(GPIOA, &GpioInitStruct);

	// パルス値初期化
	Clear();

	// パルス入力許可
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_1) != HAL_OK){
		return HAL_ERROR;
	}
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_2) != HAL_OK){
		return HAL_ERROR;
	}

	return HAL_OK;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM8 Encoder Mode クラス　コンストラクタ
// TIM8_CLK 開始
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM8_EncoderMode::TIM8_EncoderMode()
{
	__HAL_RCC_TIM8_CLK_ENABLE();
	hTim.Instance = TIM8;
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM8 Encoder Mode クラス　デストラクタ
// TIM8_CLK 停止
//--------------------------------------------------------------------------------------------
inline MiYALAB::STM32F446RE::TIM8_EncoderMode::~TIM8_EncoderMode()
{
	HAL_TIM_Encoder_Stop(&hTim, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_DeInit(&hTim);
	__HAL_RCC_TIM8_CLK_DISABLE();
}

//--------------------------------------------------------------------------------------------
// MiYA LAB OSS
// TIM8 Encoder Mode クラス　Enable関数
// TIM8 CH1(PC6), CH2(PC7) のパルス入力許可
//--------------------------------------------------------------------------------------------
inline uint8_t MiYALAB::STM32F446RE::TIM8_EncoderMode::Enable()
{
	// ハードウェア設定用データ群
	GPIO_InitTypeDef GpioInitStruct = {0};

	// クロック許可
	__HAL_RCC_GPIOA_CLK_ENABLE();

	// GPIO設定
	GpioInitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
	GpioInitStruct.Mode = GPIO_MODE_AF_PP;
	GpioInitStruct.Pull = GPIO_NOPULL;
	GpioInitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GpioInitStruct.Alternate = GPIO_AF3_TIM8;
	HAL_GPIO_Init(GPIOC, &GpioInitStruct);

	// パルス値初期化
	Clear();

	// パルス入力許可
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_1) != HAL_OK){
		return HAL_ERROR;
	}
	if(HAL_TIM_Encoder_Start(&hTim, TIM_CHANNEL_2) != HAL_OK){
		return HAL_ERROR;
	}

	return HAL_OK;
}

#endif /* SRC_MiYALAB_STM32F446RE_TIM_H_ */

//------------------------------------------------------------------------------
// end of file
//------------------------------------------------------------------------------
